Revit 2027 API
BuiltInFailures.ScheduleViewFailures.ColumnsExceedSegment Property
 Some columns in Graphical Column Schedule exceed the segment's upper/lower bounds. You can add levels or adjust the view parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ColumnsExceedSegment { get; }
Public Shared ReadOnly Property ColumnsExceedSegment As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ColumnsExceedSegment {
	FailureDefinitionId^ get ();
}
static member ColumnsExceedSegment : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ScheduleViewFailures Class
Autodesk.Revit.DB Namespace